# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

numbers_list = [2, 3, 5, 9, 3, 10, 59, 5, 23, 3]
print(list(set(numbers_list)))
